In [1]:
import pandas as pd
import numpy as np
import re

# create DataFrame

In [2]:
data = {
    'string': ['a', 'b', 'c', 'd', 'e', 'f'],
    'int': [0, 1, 2, 1, 2, 3],
    'float': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
}

In [3]:
df = pd.DataFrame(data)
df

   float  int string
0    1.5    0      a
1    1.7    1      b
2    3.6    2      c
3    2.4    1      d
4    2.9    2      e
5    3.2    3      f

In [4]:
dfWithIndex = pd.DataFrame(data, index=["one", "two", "three", "four", "five", "six"])
dfWithIndex

       float  int string
one      1.5    0      a
two      1.7    1      b
three    3.6    2      c
four     2.4    1      d
five     2.9    2      e
six      3.2    3      f

In [5]:
dfWithDict = pd.DataFrame({"float":{"one":1.1, "two":2.2, "three":3.3}, "int":{"two":2, "three":3, "four":4}, "string":{"three":"aaa", "four":"bbb", "five":"ccc"}})
dfWithDict

       float  int string
five     NaN  NaN    ccc
four     NaN  4.0    bbb
one      1.1  NaN    NaN
three    3.3  3.0    aaa
two      2.2  2.0    NaN

# check index is unique

In [6]:
dfWithIndex.index.is_unique

True

# sort by index

In [7]:
dfWithIndex.sort_index()

       float  int string
five     2.9    2      e
four     2.4    1      d
one      1.5    0      a
six      3.2    3      f
three    3.6    2      c
two      1.7    1      b

In [8]:
dfWithIndex.sort_index(axis=1, ascending=False)

      string  int  float
one        a    0    1.5
two        b    1    1.7
three      c    2    3.6
four       d    1    2.4
five       e    2    2.9
six        f    3    3.2

# sort by value

In [9]:
dfWithIndex.sort_values(by=["int", "string"])

       float  int string
one      1.5    0      a
two      1.7    1      b
four     2.4    1      d
three    3.6    2      c
five     2.9    2      e
six      3.2    3      f

# head

In [10]:
df.head()

   float  int string
0    1.5    0      a
1    1.7    1      b
2    3.6    2      c
3    2.4    1      d
4    2.9    2      e

# set columns order

In [11]:
columnsOrderDf = pd.DataFrame(data, columns=['string', 'int', 'float'])
columnsOrderDf

  string  int  float
0      a    0    1.5
1      b    1    1.7
2      c    2    3.6
3      d    1    2.4
4      e    2    2.9
5      f    3    3.2

# get specific column

In [12]:
df["string"]

0    a
1    b
2    c
3    d
4    e
5    f
Name: string, dtype: object

In [13]:
df.string

0    a
1    b
2    c
3    d
4    e
5    f
Name: string, dtype: object

# get specific row

In [14]:
dfWithIndex.loc["three", ["int", "string"]]

int       2
string    c
Name: three, dtype: object

In [15]:
dfWithIndex.iloc[2, [1, 2]]

int       2
string    c
Name: three, dtype: object

# update value

In [16]:
updateValueDf = pd.DataFrame(data)

In [17]:
updateValueDf["string"] = "x"
updateValueDf

   float  int string
0    1.5    0      x
1    1.7    1      x
2    3.6    2      x
3    2.4    1      x
4    2.9    2      x
5    3.2    3      x

In [18]:
updateValueDf["float"] = np.arange(6.)
updateValueDf

   float  int string
0    0.0    0      x
1    1.0    1      x
2    2.0    2      x
3    3.0    1      x
4    4.0    2      x
5    5.0    3      x

In [19]:
series = pd.Series([100, 300, 500], index=[1, 3, 5])
updateValueDf["float"] = series
updateValueDf

   float  int string
0    NaN    0      x
1  100.0    1      x
2    NaN    2      x
3  300.0    1      x
4    NaN    2      x
5  500.0    3      x

# add new column

In [20]:
addNewColumnDf = pd.DataFrame(data)
addNewColumnDf['new_column'] = addNewColumnDf.int > 1
addNewColumnDf

   float  int string  new_column
0    1.5    0      a       False
1    1.7    1      b       False
2    3.6    2      c        True
3    2.4    1      d       False
4    2.9    2      e        True
5    3.2    3      f        True

# delete column

In [21]:
deleteColumnDf_0 = pd.DataFrame(data)
del deleteColumnDf_0["int"]
deleteColumnDf_0

   float string
0    1.5      a
1    1.7      b
2    3.6      c
3    2.4      d
4    2.9      e
5    3.2      f

In [22]:
deleteColumnDf_1 = pd.DataFrame(data)
deleteColumnDf_1.drop(["string"], axis='columns')

   float  int
0    1.5    0
1    1.7    1
2    3.6    2
3    2.4    1
4    2.9    2
5    3.2    3

In [23]:
deleteColumnDf_inplace = pd.DataFrame(data)
deleteColumnDf_inplace.drop(["string"], axis='columns', inplace=True)
deleteColumnDf_inplace

   float  int
0    1.5    0
1    1.7    1
2    3.6    2
3    2.4    1
4    2.9    2
5    3.2    3

# delete record

In [24]:
deleteRecordDf = pd.DataFrame(data)
deleteRecordDf.drop([2,4])

   float  int string
0    1.5    0      a
1    1.7    1      b
3    2.4    1      d
5    3.2    3      f

In [25]:
deleteRecordDf_inplace = pd.DataFrame(data)
deleteRecordDf_inplace.drop([2,4], inplace=True)
deleteRecordDf_inplace

   float  int string
0    1.5    0      a
1    1.7    1      b
3    2.4    1      d
5    3.2    3      f

# transpose

In [26]:
transposedDf = pd.DataFrame(data)
transposedDf.T

          0    1    2    3    4    5
float   1.5  1.7  3.6  2.4  2.9  3.2
int       0    1    2    1    2    3
string    a    b    c    d    e    f

# sub dataframe

In [27]:
subDfByDict = {"subInt" : df.int[1:5], "subFloat" : df.float[:-3]}
pd.DataFrame(subDfByDict)

   subFloat  subInt
0       1.5     NaN
1       1.7     1.0
2       3.6     2.0
3       NaN     1.0
4       NaN     2.0

In [28]:
dfWithIndex.loc["two":"five", "float":"string"]

       float  int string
two      1.7    1      b
three    3.6    2      c
four     2.4    1      d
five     2.9    2      e

In [29]:
df.iloc[:, :3][df.index % 2 == 0]

   float  int string
0    1.5    0      a
2    3.6    2      c
4    2.9    2      e

# get value array

In [30]:
df.values

array([[1.5, 0, 'a'],
       [1.7, 1, 'b'],
       [3.6, 2, 'c'],
       [2.4, 1, 'd'],
       [2.9, 2, 'e'],
       [3.2, 3, 'f']], dtype=object)

# get index

In [31]:
dfWithIndex.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

# get max index

In [32]:
maxIndexDf = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]])
maxIndexDf.idxmax()

0    2
1    2
2    2
dtype: int64

# reindex

In [33]:
column_reindex = pd.DataFrame(
    np.arange(9).reshape((3, 3)),
    index=['a', 'c', 'd'],
    columns=['Ohio', 'Texas', 'California']
)
print(column_reindex)
print("-------------------")
print(column_reindex.reindex(columns=['Texas', 'Utah', 'California']))

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8
-------------------
   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [34]:
df.reindex(index=[1,3,5], columns=["float", "string", "not_exist"])

   float string  not_exist
1    1.7      b        NaN
3    2.4      d        NaN
5    3.2      f        NaN

# add

In [35]:
addDf_0_0 = pd.DataFrame([1,2,3], index=["a", "b", "c"])
addDf_0_1 = pd.DataFrame([20,30,40], index=["b", "c", "d"])
addDf_0_0 + addDf_0_1

      0
a   NaN
b  22.0
c  33.0
d   NaN

In [36]:
addDf_1_0 = pd.DataFrame([1,2,3], index=["a", "b", "c"])
addDf_1_1 = pd.DataFrame([20,30,40], index=["b", "c", "d"])
addDf_1_0.add(addDf_1_1, fill_value=0)

      0
a   1.0
b  22.0
c  33.0
d  40.0

# sum

In [37]:
sumDf = pd.DataFrame([[1,2,3], [4,None,6], [7,8,9]])
sumDf

   0    1  2
0  1  2.0  3
1  4  NaN  6
2  7  8.0  9

In [38]:
sumDf.sum()

0    12.0
1    10.0
2    18.0
dtype: float64

In [39]:
sumDf.sum(skipna=False)

0    12.0
1     NaN
2    18.0
dtype: float64

# accumulation

In [40]:
accumulationDf = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]])
accumulationDf.cumsum()

    0   1   2
0   1   2   3
1   5   7   9
2  12  15  18

# describe

In [41]:
describeDf = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]])
describeDf.describe()

         0    1    2
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

# apply function

In [42]:
applyFunctionDf = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]])
applyFunctionDf

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [43]:
applyFunctionDf.apply(lambda x : x.max())

0    7
1    8
2    9
dtype: int64

In [44]:
applyFunctionDf.apply(lambda x : x.max(), axis='columns')

0    3
1    6
2    9
dtype: int64

In [45]:
applyFunctionDf.apply(lambda x : pd.Series([x.min(), x.max()], index=['min', 'max']))

     0  1  2
min  1  2  3
max  7  8  9

# apply map

In [46]:
applyMapDf = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]])
applyMapDf.applymap(lambda x : x * 10)

    0   1   2
0  10  20  30
1  40  50  60
2  70  80  90

# rank

In [47]:
rankDf = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]])

In [48]:
rankDf.rank()

     0    1    2
0  1.0  1.0  1.0
1  2.0  2.0  2.0
2  3.0  3.0  3.0

In [49]:
rankDf.rank(axis='columns')

     0    1    2
0  1.0  2.0  3.0
1  1.0  2.0  3.0
2  1.0  2.0  3.0

# generate datetime index

In [50]:
dates = pd.date_range('1/1/2000', periods=7)
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

# drop NaN

In [51]:
dropNanDf = pd.DataFrame([
    [1.1, 2.2, 3.3], 
    [4.4, np.NaN, np.NaN],
    [np.NaN, np.NaN, np.NaN], 
    [np.NaN, 11.11, 12.12]
])
dropNanDf

     0      1      2
0  1.1   2.20   3.30
1  4.4    NaN    NaN
2  NaN    NaN    NaN
3  NaN  11.11  12.12

In [52]:
dropNanDf.dropna()

     0    1    2
0  1.1  2.2  3.3

In [53]:
dropNanDf.dropna(how='all')

     0      1      2
0  1.1   2.20   3.30
1  4.4    NaN    NaN
3  NaN  11.11  12.12

In [54]:
dropNanDf.dropna(thresh=2)

     0      1      2
0  1.1   2.20   3.30
3  NaN  11.11  12.12

# fill NaN

In [55]:
fillNanDf = pd.DataFrame([
    [1.1, 2.2, 3.3], 
    [4.4, np.NaN, np.NaN],
    [np.NaN, np.NaN, np.NaN], 
    [np.NaN, 11.11, 12.12]
])
fillNanDf

     0      1      2
0  1.1   2.20   3.30
1  4.4    NaN    NaN
2  NaN    NaN    NaN
3  NaN  11.11  12.12

In [56]:
fillNanDf.fillna(-1)

     0      1      2
0  1.1   2.20   3.30
1  4.4  -1.00  -1.00
2 -1.0  -1.00  -1.00
3 -1.0  11.11  12.12

In [57]:
fillNanDf.fillna({0: - 100, 1: -200, 2: -300})

       0       1       2
0    1.1    2.20    3.30
1    4.4 -200.00 -300.00
2 -100.0 -200.00 -300.00
3 -100.0   11.11   12.12

In [58]:
fillNanDf.fillna(method='ffill')

     0      1      2
0  1.1   2.20   3.30
1  4.4   2.20   3.30
2  4.4   2.20   3.30
3  4.4  11.11  12.12

In [59]:
fillNanDf.fillna(method='ffill', limit=1)

     0      1      2
0  1.1   2.20   3.30
1  4.4   2.20   3.30
2  4.4    NaN    NaN
3  NaN  11.11  12.12

In [60]:
removeDuplicateDf = pd.DataFrame({
    'col_0': ['one', 'two'] * 3 + ['two'],
    'col_1': [1, 1, 2, 3, 3, 4, 4]
})
removeDuplicateDf

  col_0  col_1
0   one      1
1   two      1
2   one      2
3   two      3
4   one      3
5   two      4
6   two      4

In [61]:
removeDuplicateDf.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [62]:
removeDuplicateDf.drop_duplicates()

  col_0  col_1
0   one      1
1   two      1
2   one      2
3   two      3
4   one      3
5   two      4

In [63]:
removeDuplicateDf.drop_duplicates(['col_0'])

  col_0  col_1
0   one      1
1   two      1

In [64]:
removeDuplicateDf.drop_duplicates(['col_0'], keep='last')

  col_0  col_1
4   one      3
6   two      4

# mapping data

In [65]:
mappingDataDf = pd.DataFrame({
    'col_0': ['one', 'two'] * 3 + ['two'],
    'col_1': [1, 1, 2, 3, 3, 4, 4]
})
mappingDataDf

  col_0  col_1
0   one      1
1   two      1
2   one      2
3   two      3
4   one      3
5   two      4
6   two      4

In [66]:
mappingData = {
    'one': '111',
    'two': '222'
}
mappingData

{'one': '111', 'two': '222'}

In [67]:
mappingDataDf['col_2'] = mappingDataDf['col_0'].map(mappingData)
mappingDataDf

  col_0  col_1 col_2
0   one      1   111
1   two      1   222
2   one      2   111
3   two      3   222
4   one      3   111
5   two      4   222
6   two      4   222

In [68]:
mappingDataDf['col_3'] = mappingDataDf['col_1'].map(lambda x : x * 10)
mappingDataDf

  col_0  col_1 col_2  col_3
0   one      1   111     10
1   two      1   222     10
2   one      2   111     20
3   two      3   222     30
4   one      3   111     30
5   two      4   222     40
6   two      4   222     40

# replace data

In [69]:
replaceDataDf = pd.DataFrame({
    'col_0': [0, 1, 2],
    'col_1': [1, 2, 3],
    'col_2': [2, 3, 4]
})
replaceDataDf

   col_0  col_1  col_2
0      0      1      2
1      1      2      3
2      2      3      4

In [70]:
replaceDataDf.replace({1: np.nan, 2: 999})

   col_0  col_1  col_2
0    0.0    NaN  999.0
1    NaN  999.0    3.0
2  999.0    3.0    4.0

# processing outliers

In [71]:
processingOutliersDf = pd.DataFrame(np.random.randn(1000, 4))
processingOutliersDf.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.034921    -0.017842     0.014417     0.038461
std       1.031438     1.022711     0.980768     1.004684
min      -3.993676    -3.288373    -2.892725    -3.477569
25%      -0.643743    -0.705336    -0.632616    -0.636609
50%       0.033528    -0.017096     0.018789     0.040806
75%       0.695115     0.686160     0.630422     0.709802
max       3.550214     3.150908     3.276822     4.361362

In [72]:
processingOutlierColDf = processingOutliersDf[0]
processingOutlierColDf[np.abs(processingOutlierColDf) > 3]

31    -3.058485
381   -3.014617
542   -3.343107
775    3.073383
816   -3.034427
874   -3.993676
927   -3.122839
956    3.550214
Name: 0, dtype: float64

In [73]:
processingOutliersDf[(np.abs(processingOutliersDf) > 3).any(1)]

            0         1         2         3
31  -3.058485 -0.069171  0.073978 -0.347657
320 -0.889191 -3.288373  0.567122 -1.119371
381 -3.014617 -0.337616  0.134533 -0.095705
414 -0.439450 -1.744088  3.042223  0.384761
437  1.173877 -1.151593 -0.184127 -3.053476
468 -0.436459 -0.505213  3.276822  0.201469
477 -1.665472 -1.245927  0.265301 -3.477569
542 -3.343107 -2.265821 -1.210241  1.396967
676 -1.378098  1.710112 -1.137601  4.361362
696  0.601909  1.023248  2.363619 -3.057646
766  2.322762  3.079729  1.487372  0.050539
775  3.073383  0.318871 -0.396548  0.333814
816 -3.034427 -0.671232 -0.695214 -0.503339
823 -0.836962  3.150908  2.776377 -1.764995
872  0.886851  0.236644 -2.390087  3.854057
874 -3.993676 -0.032584  1.693920  0.429798
927 -3.122839  1.449658 -1.497120 -0.426780
956  3.550214  0.807455  0.019313 -0.574296

In [74]:
processingOutliersDf[np.abs(processingOutliersDf) > 3]

      0   1   2   3
0   NaN NaN NaN NaN
1   NaN NaN NaN NaN
2   NaN NaN NaN NaN
3   NaN NaN NaN NaN
4   NaN NaN NaN NaN
5   NaN NaN NaN NaN
6   NaN NaN NaN NaN
7   NaN NaN NaN NaN
8   NaN NaN NaN NaN
9   NaN NaN NaN NaN
10  NaN NaN NaN NaN
11  NaN NaN NaN NaN
12  NaN NaN NaN NaN
13  NaN NaN NaN NaN
14  NaN NaN NaN NaN
15  NaN NaN NaN NaN
16  NaN NaN NaN NaN
17  NaN NaN NaN NaN
18  NaN NaN NaN NaN
19  NaN NaN NaN NaN
20  NaN NaN NaN NaN
21  NaN NaN NaN NaN
22  NaN NaN NaN NaN
23  NaN NaN NaN NaN
24  NaN NaN NaN NaN
25  NaN NaN NaN NaN
26  NaN NaN NaN NaN
27  NaN NaN NaN NaN
28  NaN NaN NaN NaN
29  NaN NaN NaN NaN
..   ..  ..  ..  ..
970 NaN NaN NaN NaN
971 NaN NaN NaN NaN
972 NaN NaN NaN NaN
973 NaN NaN NaN NaN
974 NaN NaN NaN NaN
975 NaN NaN NaN NaN
976 NaN NaN NaN NaN
977 NaN NaN NaN NaN
978 NaN NaN NaN NaN
979 NaN NaN NaN NaN
980 NaN NaN NaN NaN
981 NaN NaN NaN NaN
982 NaN NaN NaN NaN
983 NaN NaN NaN NaN
984 NaN NaN NaN NaN
985 NaN NaN NaN NaN
986 NaN NaN NaN NaN
987 NaN NaN NaN NaN
988 NaN NaN NaN NaN
989 NaN NaN NaN NaN
990 NaN NaN NaN NaN
991 NaN NaN NaN NaN
992 NaN NaN NaN NaN
993 NaN NaN NaN NaN
994 NaN NaN NaN NaN
995 NaN NaN NaN NaN
996 NaN NaN NaN NaN
997 NaN NaN NaN NaN
998 NaN NaN NaN NaN
999 NaN NaN NaN NaN

[1000 rows x 4 columns]

In [75]:
processingOutliersDf[np.abs(processingOutliersDf) > 3] = np.sign(processingOutliersDf) * 3
processingOutliersDf

            0         1         2         3
0    0.508033  0.526342 -0.763859 -0.345797
1    1.017197 -0.117751 -0.731588 -0.659518
2    2.034641 -0.106188  1.257125  0.409174
3   -0.815705 -1.979807  0.340740  0.505188
4   -1.273810 -0.727365  0.193305  1.166887
5    0.700998  0.140015  0.915945 -1.322417
6   -1.142149 -1.684615 -1.158275  1.324193
7   -0.442781 -1.728015  0.687426 -1.402684
8   -1.235615  1.039554 -1.724768  0.822804
9    0.452813 -0.096094  1.285378  1.750083
10  -0.461819 -0.644627 -0.973547 -0.461565
11   0.380304 -0.127957  0.643938 -1.288257
12  -1.115990  0.814762 -1.166119  0.132977
13   0.593726 -0.255824  1.269097 -0.801092
14  -0.089719  2.037399 -1.448164 -0.007758
15   0.030123 -0.195720  0.243382  0.598981
16   1.152460  2.034156 -0.167250  1.519337
17   0.939239  1.184872 -0.170397  0.676646
18  -0.261314  0.523309  0.107073  0.531729
19   0.174859  0.684458 -1.375036  0.931477
20  -0.990338  0.471097  1.083105  2.041245
21   0.172427  0.035639  0.807893 -1.360895
22   0.923065 -0.556412 -0.377441 -0.067665
23  -0.867793 -1.180347 -0.531194 -0.928391
24  -1.875645 -0.815323 -2.358568  0.113824
25  -1.711455 -0.215609  0.018266  0.411217
26  -0.833277 -0.082242 -1.256530  1.043652
27   1.047946 -0.832585  0.413663 -1.126761
28   0.382793 -0.655855  1.241693  0.887782
29  -1.713666 -1.093317  1.583889 -0.000649
..        ...       ...       ...       ...
970 -1.597113  0.206433  0.205177 -0.210089
971 -0.987924 -0.339805 -0.545785  0.281068
972  1.468678  0.525790  0.219961 -0.239867
973  0.440755  1.012347 -0.633046  1.114986
974  2.407311  0.741435  0.221104 -0.257408
975 -0.199579 -0.156051  0.007313 -0.050849
976 -0.245923  0.048882  0.405991 -1.231381
977 -0.234642  0.573910  1.541295  1.756144
978 -0.223237 -2.284837 -1.096937  0.671204
979 -0.417707 -0.601001 -0.623161  0.145131
980  0.527979  0.718127 -0.298349 -1.003631
981  0.492602 -0.957071  0.414977  0.714443
982 -0.644772 -0.544173 -0.235537  0.493902
983 -0.126986 -2.361383 -0.466254  1.074665
984 -0.451945  0.459440  0.725137 -2.326488
985  1.619104 -0.773118 -0.114343  0.749706
986 -0.773392  1.109674 -0.688873 -0.238972
987  0.157095 -2.086320  1.041798  0.939158
988  0.310655 -0.447360 -0.665196  1.313632
989  0.950249 -1.632368 -0.302544  1.801860
990  1.353741  0.022632 -0.438676 -1.012799
991  0.734539 -0.449855  0.089712 -0.311221
992 -0.509906 -0.052374 -0.426837  1.327237
993 -0.516331 -0.167491  0.272507 -0.317332
994 -0.783442 -0.022194 -0.432278 -0.417873
995  0.840641  0.222006  0.216145 -0.592003
996  1.236843 -0.011290  0.538100  1.378091
997 -1.399858 -1.055734 -0.521496 -0.648343
998  0.448337 -0.978816  0.066040  1.260098
999 -0.782138 -0.531912 -0.271233  1.354732

[1000 rows x 4 columns]

# sampling data

In [76]:
samplingDataDf = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
samplingDataDf

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [77]:
samplingDataSampler = np.random.permutation(5)
samplingDataSampler

array([3, 0, 2, 1, 4])

In [78]:
samplingDataDf.take(samplingDataSampler)

    0   1   2   3
3  12  13  14  15
0   0   1   2   3
2   8   9  10  11
1   4   5   6   7
4  16  17  18  19

In [79]:
samplingDataDf.sample(n=3)

    0   1   2   3
3  12  13  14  15
1   4   5   6   7
4  16  17  18  19

# dummy variable

In [80]:
dummyVariableDf = pd.DataFrame({'col_0': ['b', 'b', 'a', 'c', 'a', 'b']})
dummyVariableDf

  col_0
0     b
1     b
2     a
3     c
4     a
5     b

In [81]:
pd.get_dummies(dummyVariableDf['col_0'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [82]:
dummyVariable = np.random.rand(10)
dummyVariable

array([0.88026046, 0.76808572, 0.84455519, 0.47158661, 0.54280147,
       0.55388574, 0.95287893, 0.9181998 , 0.53634656, 0.01008164])

In [83]:
dummyVariableBins = [0, 0.2, 0.4, 0.6, 0.8, 1]
dummyVariableBins

[0, 0.2, 0.4, 0.6, 0.8, 1]

In [84]:
pd.get_dummies(pd.cut(dummyVariable, dummyVariableBins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           0           0           1           0
2           0           0           0           0           1
3           0           0           1           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           0           1
8           0           0           1           0           0
9           1           0           0           0           0

# string function

In [85]:
stringFunctionDf = pd.DataFrame({
    'col_0': ['abc', 'xyz', '123']
})
stringFunctionDf

  col_0
0   abc
1   xyz
2   123

In [86]:
stringFunctionDf['col_0'].str.contains('xy')

0    False
1     True
2    False
Name: col_0, dtype: bool

In [87]:
stringFunctionDf['col_0'].str.findall('[a1]', flags=re.IGNORECASE)

0    [a]
1     []
2    [1]
Name: col_0, dtype: object

In [88]:
stringFunctionDf['col_0'].str.match('[a1]', flags=re.IGNORECASE)

0     True
1    False
2     True
Name: col_0, dtype: bool

# hierarchical indexing

In [89]:
hierarchicalIndexing = pd.DataFrame(
    np.arange(12).reshape((4, 3)),
    index=[
        ['a', 'a', 'b', 'b'], 
        [1, 2, 1, 2]
    ],
    columns=[
        ['col_A', 'col_A', 'col_B'],
        ['col_0', 'col_1', 'col_2']
    ]
)
hierarchicalIndexing

    col_A       col_B
    col_0 col_1 col_2
a 1     0     1     2
  2     3     4     5
b 1     6     7     8
  2     9    10    11

In [90]:
hierarchicalIndexing["col_A"]["col_0"]["a"][2]

3

In [91]:
hierarchicalIndexing.index.names = ['idx_0', 'idx_1']
hierarchicalIndexing.columns.names = ['c_0', 'c_1']
hierarchicalIndexing

c_0         col_A       col_B
c_1         col_0 col_1 col_2
idx_0 idx_1
a     1         0     1     2
      2         3     4     5
b     1         6     7     8
      2         9    10    11

In [92]:
hierarchicalIndexing.swaplevel("idx_0", "idx_1")

c_0         col_A       col_B
c_1         col_0 col_1 col_2
idx_1 idx_0
1     a         0     1     2
2     a         3     4     5
1     b         6     7     8
2     b         9    10    11

In [93]:
hierarchicalIndexing.sort_index(level=1)

c_0         col_A       col_B
c_1         col_0 col_1 col_2
idx_0 idx_1
a     1         0     1     2
b     1         6     7     8
a     2         3     4     5
b     2         9    10    11

In [94]:
hierarchicalIndexing.sum(level="idx_0")

c_0   col_A       col_B
c_1   col_0 col_1 col_2
idx_0
a         3     5     7
b        15    17    19

# indexing with columns

In [95]:
indexingWithColumns = pd.DataFrame({
    'a': range(7), 
    'b': range(7, 0, -1),
    'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
    'd': [0, 1, 2, 0, 1, 2, 3]
})
indexingWithColumns

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [96]:
indexingWithColumns.set_index(['c', 'd'])

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [97]:
indexingWithColumns.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

# reset index

In [98]:
resetIndex = pd.DataFrame(
    np.arange(12).reshape((4, 3)),
    index=[
        ['a', 'a', 'b', 'b'], 
        [1, 2, 1, 2]
    ],
    columns=[
        ['col_A', 'col_A', 'col_B'],
        ['col_0', 'col_1', 'col_2']
    ]
)
resetIndex

    col_A       col_B
    col_0 col_1 col_2
a 1     0     1     2
  2     3     4     5
b 1     6     7     8
  2     9    10    11

In [99]:
resetIndexResult = resetIndex.reset_index()
resetIndexResult

  level_0 level_1 col_A       col_B
                  col_0 col_1 col_2
0       a       1     0     1     2
1       a       2     3     4     5
2       b       1     6     7     8
3       b       2     9    10    11

# join

In [118]:
joinDf_0 = pd.DataFrame({
    'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
    'data': range(7)
})
joinDf_0

   data key
0     0   b
1     1   b
2     2   a
3     3   c
4     4   a
5     5   a
6     6   b

In [119]:
joinDf_1 = pd.DataFrame({
    'key': ['a', 'b', 'd'],
    'data': range(3)
})
joinDf_1

   data key
0     0   a
1     1   b
2     2   d

In [121]:
pd.merge(joinDf_0, joinDf_1, on="key", suffixes=('_left', '_right'), how="outer")

   data_left key  data_right
0        0.0   b         1.0
1        1.0   b         1.0
2        6.0   b         1.0
3        2.0   a         0.0
4        4.0   a         0.0
5        5.0   a         0.0
6        3.0   c         NaN
7        NaN   d         2.0

In [109]:
joinDf_2 = pd.DataFrame({
    'key_2': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
    'data_2': range(7)
})
joinDf_2

   data_2 key_2
0       0     b
1       1     b
2       2     a
3       3     c
4       4     a
5       5     a
6       6     b

In [110]:
joinDf_3 = pd.DataFrame({
    'key_3': ['a', 'b', 'd'],
    'data_3': range(3)
})
joinDf_3

   data_3 key_3
0       0     a
1       1     b
2       2     d

In [112]:
pd.merge(joinDf_2, joinDf_3, left_on='key_2', right_on='key_3', how="outer")

   data_2 key_2  data_3 key_3
0     0.0     b     1.0     b
1     1.0     b     1.0     b
2     6.0     b     1.0     b
3     2.0     a     0.0     a
4     4.0     a     0.0     a
5     5.0     a     0.0     a
6     3.0     c     NaN   NaN
7     NaN   NaN     2.0     d

In [113]:
joinDf_4 = pd.DataFrame({
    'key_4_0': ['a', 'a', 'b'],
    'key_4_1': [1, 2, 1],
    'val_4': ['A', 'B', 'C']
})
joinDf_4

  key_4_0  key_4_1  val_4
0       a        1      1
1       a        2      2
2       b        1      3

In [114]:
joinDf_5 = pd.DataFrame({
    'key_5_0': ['a', 'a', 'b', 'b'],
    'key_5_1': [1, 1, 1, 2],
    'val_5': ['D', 'E', 'F', 'G']
})
joinDf_5

  key_5_0  key_5_1 val_5
0       a        1     D
1       a        1     E
2       b        1     F
3       b        2     G

In [117]:
pd.merge(joinDf_4, joinDf_5, left_on=['key_4_0', 'key_4_1'], right_on=['key_5_0', 'key_5_1'], how='outer')

  key_4_0  key_4_1  val_4 key_5_0  key_5_1 val_5
0       a      1.0    1.0       a      1.0     D
1       a      1.0    1.0       a      1.0     E
2       a      2.0    2.0     NaN      NaN   NaN
3       b      1.0    3.0       b      1.0     F
4     NaN      NaN    NaN       b      2.0     G

In [122]:
joinDf_6 = pd.DataFrame({
    'key_6': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
    'data_6': range(7)
})
joinDf_6

   data_6 key_6
0       0     b
1       1     b
2       2     a
3       3     c
4       4     a
5       5     a
6       6     b

In [124]:
joinDf_7 = pd.DataFrame({
    'data_7': range(3),
},
    index=['a', 'b', 'd'],
)
joinDf_7

   data_7
a       0
b       1
d       2

In [127]:
pd.merge(joinDf_6, joinDf_7, left_on='key_6', right_index=True, how='outer')

   data_6 key_6  data_7
0     0.0     b     1.0
1     1.0     b     1.0
6     6.0     b     1.0
2     2.0     a     0.0
4     4.0     a     0.0
5     5.0     a     0.0
3     3.0     c     NaN
6     NaN     d     2.0

In [128]:
joinDf_8 = pd.DataFrame({
    'key_8_0': ['a', 'a', 'b'],
    'key_8_1': [1, 2, 1],
    'val_8': ['A', 'B', 'C']
})
joinDf_8

  key_8_0  key_8_1 val_8
0       a        1     A
1       a        2     B
2       b        1     C

In [130]:
joinDf_9 = pd.DataFrame(
    data={
        'val_9': ['D', 'E', 'F', 'G']
    },
    index=[
        ['a', 'a', 'b', 'b'],
        [1, 1, 1, 2]
    ]
)
joinDf_9

    val_9
a 1     D
  1     E
b 1     F
  2     G

In [137]:
pd.merge(joinDf_8, joinDf_9, left_on=['key_8_0', 'key_8_1'], right_index=True, how="outer")

  key_8_0  key_8_1 val_8 val_9
0       a        1     A     D
0       a        1     A     E
1       a        2     B   NaN
2       b        1     C     F
2       b        2   NaN     G

In [135]:
joinDf_10 = pd.DataFrame(
    data={
        'val_10': ['A', 'B', 'C']
    },
    index=[
        ['a', 'a', 'b'],
        [1, 2, 1]
    ]
)
joinDf_10

    val_10
a 1      A
  2      B
b 1      C

In [136]:
joinDf_11 = pd.DataFrame(
    data={
        'val_11': ['D', 'E', 'F', 'G']
    },
    index=[
        ['a', 'a', 'b', 'b'],
        [1, 1, 1, 2]
    ]
)
joinDf_11

    val_11
a 1      D
  1      E
b 1      F
  2      G

In [138]:
pd.merge(joinDf_10, joinDf_11, left_index=True, right_index=True, how="outer")

    val_10 val_11
a 1      A      D
  1      A      E
  2      B    NaN
b 1      C      F
  2    NaN      G

# concate

In [139]:
concateDf_0 = pd.DataFrame(
    data=np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],
    columns=['one', 'two']
)
concateDf_0

   one  two
a    0    1
b    2    3
c    4    5

In [140]:
concateDf_1 = pd.DataFrame(
    data=5 + np.arange(4).reshape(2, 2), 
    index=['a', 'c'],
    columns=['three', 'four']
)
concateDf_1

   three  four
a      5     6
c      7     8

In [142]:
pd.concat([concateDf_0, concateDf_1], axis=1, keys=['df_0', 'df_1'])

  df_0      df_1
   one two three four
a    0   1   5.0  6.0
b    2   3   NaN  NaN
c    4   5   7.0  8.0

In [143]:
concateDf_2 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
concateDf_2

          a         b         c         d
0  2.304217 -2.472724  0.065083 -0.198273
1 -1.186353  0.726974  0.761043  1.531056
2  1.703795 -0.042210 -1.078099  0.182274

In [144]:
concateDf_3 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])
concateDf_3

          b         d         a
0 -0.649204  0.030192  2.320603
1 -0.416082 -0.048962 -0.185832

In [147]:
pd.concat([concateDf_2, concateDf_3], ignore_index=True)

          a         b         c         d
0  2.304217 -2.472724  0.065083 -0.198273
1 -1.186353  0.726974  0.761043  1.531056
2  1.703795 -0.042210 -1.078099  0.182274
3  2.320603 -0.649204       NaN  0.030192
4 -0.185832 -0.416082       NaN -0.048962